Revit 2024 API
Gradient.GradientPosition Property
 The property labeled "Position" from the "Gradient" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string GradientPosition { get; }
Visual Basic
Public Shared ReadOnly Property GradientPosition As String
	Get
Visual C++
public:
static property String^ GradientPosition {
	String^ get ();
}
Remarks
 This property is a "AssetPropertyList" of type "AssetPropertyDouble".
See Also
Gradient Class
Autodesk.Revit.DB.Visual Namespace